-- phpMyAdmin SQL Dump
-- version 4.5.2
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: 2016-09-12 07:29:57
-- 服务器版本： 10.1.9-MariaDB
-- PHP Version: 5.6.15

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `baidu-news`
--

-- --------------------------------------------------------

--
-- 表的结构 `news`
--

CREATE TABLE `news` (
  `id` int(100) UNSIGNED NOT NULL,
  `title` char(100) NOT NULL,
  `img` varchar(500) NOT NULL,
  `content` text NOT NULL,
  `time` date NOT NULL,
  `classify` enum('tuijian','baijia','bendi','tupian','yule','shehui') NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `news`
--

INSERT INTO `news` (`id`, `title`, `img`, `content`, `time`, `classify`) VALUES
(14, '山东大学回应"学费贵"等问题:万元学费究竟高在哪', 'http://t10.baidu.com/it/u=87452538,696822718&fm=170&s=1381DC016AAA2E0D4CBC4DA003007012&w=218&h=146&img.JPEG', ' 　　据政策,学分制收费实行“两部制”计费方式,学生学费由专业注册学费和学分学费两部分组成。专业注册学费按学生实际在校就读的学年计收,学分学费按修读课程的学分计收。在山大各专业的收费标准里，软件工程专业的注册费达8250元，加上学分学费，一年过万，引起不少学生不解。', '2016-09-11', 'tuijian'),
(15, '冯小刚：这么多年我服务观众，现在很想冒犯观众', 'http://t10.baidu.com/it/u=3252221685,2370394214&fm=170&s=6571C96ED51A85D602E930080300C092&w=218&h=146&img.JPEG', ' 　　搜狐娱乐讯 （哈麦/文）9月10日，冯小刚出席多伦多国际电影节大师班论坛，透露自己下一部电影是和自己青春往事有关的自传电影，预计明年开拍。从此前曝光的消息看，这部电影应该就是《歌声离我远去》，讲他那个年代文艺兵的生活。', '2016-09-11', 'tuijian'),
(16, '你真的需要一个微信公号吗？', 'http://t12.baidu.com/it/u=2909585480,2404792389&fm=170&s=DAA8AD445A9CFA057FF6C1630300F07B&w=218&h=146&img.JPEG', ' 　　过去，我兴致勃勃地在各种场合聊微信时，没人搭理我；可是现在，当身边的人都在聊微信，我的心更加不安了。 有几次，我直言不讳地劝告几个相熟的朋友，不要迷信微信，不如回归到商品的质量上，到处求赞送礼，只是粗暴式的营销，很容易招人厌。良药苦口，我这样说了，他们马上丢来一句：难道微信只有你们做媒体的人才可以玩吗？ 几次碰壁后，我学乖了，当被要求评测各类微信公号的时候，我也做一把虚伪的好人，点头称赞，可以呀挺好的，与之俱进嘛。 每次，我这么应酬，内心总会涌现一个嘲笑的鬼脸：看吧，岁月是一把杀猪刀，终究把你变成你曾经无比讨厌的那个虚伪男人。 这就像玩古董，初学者不懂，无知者无畏，有的愣头青硬是散尽家财，买一堆火光冲天的赝品，然后找行家鉴定。一些行家也是愣头青，直言不讳地说：这玩意是假的啊，根本不值钱。 买家马上晕死。有位古董行家对我说过，说真话的代价太大，很容易伤害人。', '2016-09-11', 'baijia'),
(17, '患癌女星徐婷最后时光：弥留之际默念阿弥陀佛', 'http://t10.baidu.com/it/u=961144689,2458980355&fm=170&s=22CA22FA668B66F447044D5A030090F2&w=218&h=146&img.JPEG', ' 　　9月7日下午，在北京304医院的病房里，徐婷躺在病床上，插着呼吸管，肺部感染，胳膊已因细菌感染而溃烂，而后，呼吸停止。此前，她已经辗转治疗了近半年。', '2016-09-10', 'tuijian'),
(18, '全国这30个小城镇房价过万了！快来看有没有你的家乡', 'http://t12.baidu.com/it/u=3704742032,362709391&fm=170&s=38156C94481613C802121014030050EA&w=218&h=146&img.JPEG', '据中国房价行情平台最新出炉的全国小城镇房价排行榜统计，河北廊坊辖下燕郊镇（属县级市三河），8月均价达到了20794元/平方米，成为唯一一个均价突破2万大关的小城镇。', '2016-09-10', 'bendi'),
(21, '单品月销300万，看“水果大王”百果园如何玩转有赞销售员', 'http://t12.baidu.com/it/u=2400363056,3985802987&fm=170&s=D48006F7023459826E23B5F80300D039&w=218&h=146&img.JPEG', ' 　　作为中国乃至全球“水果专营连锁业态”的开创者，“百果园”目前拥有1500余家直营店，遍布全国9大省、19个大中城市。如今，这位水果大王又在有赞开店上 “尝到了甜头“。', '2016-09-12', 'baijia'),
(22, '如果这些个网红语用文言文翻译的话…', 'http://t12.baidu.com/it/u=4245347828,3107059775&fm=170&s=1130693351C168E0504CD9CF030030A0&w=218&h=146&img.PNG', ' 　　要说文化装B的最高境界那就是——学会使用古文体，在平时的聊天中时不时的冒出一两句文言文，那可比说一两句Chinese  English有文化多了~不信？我们来听听如果那些个网络语用文言文表达的话，是不是更有范儿呢', '2016-09-12', 'baijia'),
(23, '52岁北京友谊商店走下神坛：商品积灰 店员退休', 'http://t10.baidu.com/it/u=2717580219,2096030438&fm=170&s=9EC27A2358CEBECC6E8158860100E091&w=218&h=146&img.JPEG', ' 　　北京青年报9月12日消息，随着电商冲击，曾经风光无限的实体百货店都在寻求出路。然而在北京寸土寸金的长安街沿线，却有一家商店像“文物”几十年少有变化。这就是北京友谊商店，曾经作为国内最早的涉外商店之一，是新中国第一家为常驻外宾、旅游团队提供服务的大规模涉外商店。', '2016-09-12', 'bendi'),
(24, '“小豆包”开学第一周 “80后”父母患上“焦虑症”', 'http://t11.baidu.com/it/u=3114079789,4110379451&fm=170&s=26206DA74D031EC040DCAD9903006083&w=218&h=146&img.JPEG', ' 　　2016年9月12日讯，“开学后，孩子的教育从哪方面入手？小饭桌吃饭营养卫生吗？”......孩子们正式进入新学期的学习已经有一周时间了。本市中小学生开学已满一周，今年的一年级新生里，有相当一部分是出生在2010年的孩子，他们的父母有很多都是“80后”。进入崭新的小学生活后，这些“10后”萌娃和“80后”父母都遇到了种种不适应，为了帮助家长和一年级新生适应新的学校生活，一年级老师也都使出了浑身解数。有些家长甚至表示自己从未如此焦虑。 ', '2016-09-12', 'bendi');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `news`
--
ALTER TABLE `news`
  MODIFY `id` int(100) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
